// 1. Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
document.write("Завдання 1.Є змінна х, якій ви надаєте довільне числове значення.Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3", "<br/>", "<br/>");

let x = +prompt("Завдання 1.Є змінна х, якій ви надаєте довільне числове значення.Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3 ", '1');
document.write(`x = ${x}`, "<br/>", "<br/>");
if (isNaN(x)) {
    document.write('Результат:  Ви ввели не число!');
} else if (x !== 0) {
    document.write("Результат:  'Вірно'");
} else {
    document.write("Результат:  'Невірно'");
}
document.body.append(document.createElement('hr'));

// 2. Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

document.write('Завдання 2.Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число(в першу, другу, третю или четверту частину години).', "<br/>", "<br/>");

let time = +prompt('Завдання 2.Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число(в першу, другу, третю или четверту частину години).', '0');
document.write(`time = ${time}`, "<br/>", "<br/>");

if (time < 0 || time > 59) {
    document.write('Результат: Ви ввели не корректні дані...', "<br/>", "<br/>");
} else if (time >= 0 && time < 15) {
    document.write(`Результат:  Число ${time} належить до першої чверті години`, "<br/>", "<br/>");
} else if (time >= 15 && time < 30) {
    document.write(`Результат:  Число ${time}  належить до другої чверті години`, "<br/>", "<br/>");
} else if (time >= 30 && time < 45) {
    document.write(`Результат:  Число ${time} належить до третьої чверті години`, "<br/>", "<br/>");
} else if (time >= 45 && time < 60) {
    document.write(`Результат:  Число ${time} належить до четвертої чверті години`, "<br/>", "<br/>");
} else {
    document.write('Результат:  Ви ввели не число!');
}
document.body.append(document.createElement('hr'))

// 3. У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
document.write('Завдання 3.У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).', "<br/>", "<br/>");

let day = +prompt('Завдання 3.У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).', '1');
document.write(`day = ${day}`, "<br/>", "<br/>");

if (day < 1 || day > 31) {
    document.write('ЗРезультат: Ви ввели не корректні дані...', "<br/>", "<br/>");
} else if (day >= 1 && day <= 10) {
    document.write(`Результат:  Число ${day} належить до першої декади місяця`, "<br/>", "<br/>");
} else if (day > 10 && day <= 20) {
    document.write(`Результат:  Число ${day} належить до другої декади місяця`, "<br/>", "<br/>");
} else if (day >= 20 && day <= 31) {
    document.write(`Результат: Число ${day} належить до третьої декади місяця`, "<br/>", "<br/>");
} else {
    document.write('Результат:  Ви ввели не число!', "<br/>", "<br/>");
}
document.body.append(document.createElement('hr'));

// 4. Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані
// відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
document.write('Завдання 4. Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).', "<br/>", "<br/>");

let key = +prompt('Завдання 4. Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день. Введіть порядковий номер дня тижня(від 1 до 7 включно):', '1',);
document.write(`key = ${key}`, "<br/>", "<br/>");

if (key <= 0 || key > 7) {
    document.write('Завдання 4. Ви ввели не корректні дані...', "<br/>", "<br/>");
} else if (key > 0 && key <= 7) {
    switch (key) {
        case 1:
            document.write('Завдання 4. День 1 ПН: Робота. Не нехтуй оповіщеннями про "ракетну небезпеку".', "<br/>", "<br/>");
            break;
        case 2:
            document.write('Завдання 4. День 2 ВТ: Сідай вчити JS. Дальше важче буде.', "<br/>", "<br/>");
            break;
        case 3:
            document.write('Завдання 4. День 3 СР: Зустріч з друзями!', "<br/>", "<br/>");
            break;
        case 4:
            document.write('Завдання 4. День 4 ЧТ: Сходити в магазин за продуктами,можна ще прогулятись трошки.', "<br/>", "<br/>");
            break;
        case 5:
            document.write('Завдання 4. День 5 ПТ: Робота. Не забудь сходити до "шефа"!!! ', "<br/>", "<br/>");
            break;
        case 6:
            document.write('Завдання 4. День 6 СБ: Урааа, субота, вихідний... після інгліша :)', "<br/>", "<br/>");
            break;
        case 7:
            document.write('Завдання 4. День 7 НД: Роби що заманеься!', "<br/>", "<br/>");
            break;
        default :
            document.write('8 днів в тижні це прикольно :)... Скільки можна було б зробити :)', "<br/>", "<br/>");
    }
} else {
    document.write('Результат:  Ви ввели не число!', "<br/>", "<br/>");
}
document.body.append(document.createElement('hr'));

// 5. Користувач вводить або має два числа. Потрібно знайти та вивести максимальне число з тих двох . Також потрібно врахувати коли введені рівні числа.
document.write('Завдання 5. Користувач вводить або має два числа. Потрібно знайти та вивести максимальне число з тих двох . Також потрібно врахувати коли введені рівні числа.', "<br/>", "<br/>");

let num_x = 100;
let num_y = 65;
if (!!num_x && !!num_y) {
    let status = confirm(`Завдання 5. У вас є два чила: x = ${num_x} & y = ${num_y}.Якщо натиснути "Cancel(Скасувати)" - повторно введіть числа, інакше "Ok", щоб приступити для порівняння чисел`)

    if (!!status === false) {
        num_x = +prompt('Завдання 5. Введіть х: ', '1');
        num_y = +prompt('Завдання 5. Введіть у: ', '2');
    }
} else {
    num_x = +prompt('Завдання 5. Введіть х: ', '1');
    num_y = +prompt('Завдання 5. Введіть у: ', '2');
}
if (num_x === num_y) {
    document.write(`Результат: Введенні х(${num_x}) і y(${num_y}) рівні`, "<br/>", "<br/>");
} else if (num_x > num_y) {
    document.write(`Результат:  х(${num_x}) більше від y(${num_y})`, "<br/>", "<br/>");
} else {
    document.write(`Результат:  y(${num_y}) більше від x(${num_x})`, "<br/>", "<br/>");
}
document.body.append(document.createElement('hr'));

// 6. Є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"
//         якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)
document.write('Завдання 6. Є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно).' + ' Напишіть код який, за допомоги  оператора || буде присвоювати змінній х значення "default" ' + 'якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)', "<br/>", "<br/>");

let x_value = prompt('Завдання 6. Є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно).' + ' Напишіть код який, за допомоги  оператора || буде присвоювати змінній х значення "default" ' + 'якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false).', 'Insert value:');

document.write(x_value, ' - ');
(x_value === 'null') || (x_value === 'undefined') || (x_value === 'NaN') || (+x_value === 0) || (x_value === 'false') ? x_value = 'default' : x_value;
document.write(x_value, "<br/>", "<br/>");

document.body.append(document.createElement('hr'))