// 2. є сторінка rules.html. Контентом сторінки є заголовки та параграфи.
// Заголовки (h2) характеризують тему контенту яка вказана в параграфі.
//     створити скріпт, котрий зчитує всі заголовки,
//     та робить в блоці з id=content з них список(ul>li),
//     який буде змістом того, що знаходиться на сторінці.
//     Скріпт повинен працювати навіть якщо кількість блоків з
//     заголовком та параграфом зміниться.


let idContent = document.getElementById('content');
console.log(idContent.children)

let  h2Arr = document.getElementsByTagName('h2');
console.log(h2Arr)
